// Gospodi1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main() {
    int a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15, a16, a17, a18, a19, a20, a21, a22, a23, a24, a25, a26, a27, a28, a29, a30, a31, a32, a33, a34, a35, a36, a37, a38, a39, a40;
    setlocale(0, "");

    cout << "1 вопрос:" << endl; //1
    cout << endl;
    cout << "1: Что просил у великого и ужасного Гудвина Железный Дровосек? " << endl;
    cout << "[1]" << "Деньги" << endl;
    cout << "[2]" << "Мозг" << endl;
    cout << "[3]" << "Сердце" << endl;
    cout << "Введите ответ: ";
    cin >> a1;
    if (a1 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a1 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "2 вопрос:" << endl; //2
    cout << endl;
    cout << "2: Где впервые состялась первомайская демонстрация? " << endl;
    cout << "[1]" << "Чикаго" << endl;
    cout << "[2]" << "Нижний новгород" << endl;
    cout << "[3]" << "Манчестер" << endl;
    cout << "Введите ответ: ";
    cin >> a2;
    if (a2 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a2 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "3 вопрос:" << endl; //3
    cout << endl;
    cout << "3: Какой русский писатель иллюстрировал для своих детей роман Жюля Верна Вокруг света за 80 дней? " << endl;
    cout << "[1]" << "Иван Тургенев " << endl;
    cout << "[2]" << "Лев Толстой" << endl;
    cout << "[3]" << "Федор Достоевский" << endl;
    cout << "Введите ответ: ";
    cin >> a3;
    if (a3 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a1 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "4 вопрос:" << endl; //4
    cout << endl;
    cout << "4: Во что впадают зимой некоторые животные? " << endl;
    cout << "[1]" << "В бешенство" << endl;
    cout << "[2]" << "В нирвану" << endl;
    cout << "[3]" << "В спячку" << endl;
    cout << "Введите ответ: ";
    cin >> a4;
    if (a4 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a4 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "5 вопрос:" << endl; //5
    cout << endl;
    cout << "5: сколько углов у квадрата ? " << endl;
    cout << "[1]" << "3 " << endl;
    cout << "[2]" << "4" << endl;
    cout << "[3]" << "6" << endl;
    cout << "Введите ответ: ";
    cin >> a5;
    if (a5 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a5 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "6 вопрос:" << endl; //6
    cout << endl;
    cout << "6: Как называется азиатское королевство в труднопроходимой части Восточных Гималаев? " << endl;
    cout << "[1]" << "Бутан " << endl;
    cout << "[2]" << "Этан" << endl;
    cout << "[3]" << "Пропан" << endl;
    cout << "Введите ответ: ";
    cin >> a6;
    if (a6 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a6 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "7 вопрос:" << endl;//7
    cout << endl;
    cout << "7: сколько месяцов в году ? " << endl;
    cout << "[1]" << "12 " << endl;
    cout << "[2]" << "13" << endl;
    cout << "[3]" << "18" << endl;
    cout << "Введите ответ: ";
    cin >> a7;
    if (a7 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a7 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "8 вопрос:" << endl;//8
    cout << endl;
    cout << "8: Какое прозвище было у А.С.Пушкина в литературном обществе Арзамас?" << endl;
    cout << "[1]" << "Армянин" << endl;
    cout << "[2]" << "Ахилл" << endl;
    cout << "[3]" << "Сверчок" << endl;
    cout << "Введите ответ: ";
    cin >> a8;
    if (a8 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a8 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "9 вопрос:" << endl;//9
    cout << endl;
    cout << "9: Как в известной драме Гёте звали покровителя доктора Фауста?" << endl;
    cout << "[1]" << "Мефистофель" << endl;
    cout << "[2]" << "Лангвор" << endl;
    cout << "[3]" << "Лезювир" << endl;
    cout << "Введите ответ: ";
    cin >> a9;
    if (a9 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a9 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "10 вопрос:" << endl; //10
    cout << endl;
    cout << "10: Произведение какого художника можно увидеть зимой на окнах?" << endl;
    cout << "[1]" << "Ильи Репина" << endl;
    cout << "[2]" << "Дед Мороза" << endl;
    cout << "[3]" << "Василия Кандинского" << endl;
    cout << "Введите ответ: ";
    cin >> a10;
    if (a10 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a10 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "11 вопрос:" << endl; //11
    cout << endl;
    cout << "11: В какой области Уинстон Черчилль получил Нобелевскую премию?" << endl;
    cout << "[1]" << "Экономика" << endl;
    cout << "[2]" << "Литература" << endl;
    cout << "[3]" << "Физика" << endl;
    cout << "Введите ответ: ";
    cin >> a11;
    if (a11 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a11 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "12 вопрос:" << endl; //12
    cout << endl;
    cout << "12: Как по народному календарю называется самый короткий день в году?" << endl;
    cout << "[1]" << "Анна зимняя " << endl;
    cout << "[2]" << "Никола зимний" << endl;
    cout << "[3]" << "Наум-грамотник" << endl;
    cout << "Введите ответ: ";
    cin >> a12;
    if (a12 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a12 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;


    cout << "13 вопрос:" << endl; //13
    cout << endl;
    cout << "13: сколько градусов у круга ? " << endl;
    cout << "[1]" << "270 " << endl;
    cout << "[2]" << "180" << endl;
    cout << "[3]" << "360" << endl;
    cout << "Введите ответ: ";
    cin >> a13;
    if (a13 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a13 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "14 вопрос:" << endl; //14
    cout << endl;
    cout << "14: В какой стране находится Версаль?" << endl;
    cout << "[1]" << "Англия" << endl;
    cout << "[2]" << "Испания" << endl;
    cout << "[3]" << "Франция" << endl;
    cout << "Введите ответ: ";
    cin >> a14;
    if (a14 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a14 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "15 вопрос:" << endl; //15
    cout << endl;
    cout << "15: Как называется газон из цветущих пёстрых трав?" << endl;
    cout << "[1]" << "Мавританский" << endl;
    cout << "[2]" << "Ливийский" << endl;
    cout << "[3]" << "Камерунский" << endl;
    cout << "Введите ответ: ";
    cin >> a15;
    if (a15 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a15 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "16 вопрос:" << endl; //16
    cout << endl;
    cout << "16: Какое яблоко находится на передней стороне шеи мужчины?" << endl;
    cout << "[1]" << "Ноево" << endl;
    cout << "[2]" << "Адамово" << endl;
    cout << "[3]" << "Евино" << endl;
    cout << "Введите ответ: ";
    cin >> a16;
    if (a16 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a16 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "17 вопрос:" << endl; //17
    cout << endl;
    cout << "17:сколкько градусов в треугольнике  ? " << endl;
    cout << "[1]" << "270 " << endl;
    cout << "[2]" << "180" << endl;
    cout << "[3]" << "90" << endl;
    cout << "Введите ответ: ";
    cin >> a17;
    if (a17 == 2)
    {

        cout << "ответ правильный";


    }
    else if (a17 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "18 вопрос:" << endl; //18
    cout << endl;
    cout << "18: Какой язык считается самым плохим языком программирования?" << endl;
    cout << "[1]" << "Бэйсик" << endl;
    cout << "[2]" << "Си++" << endl;
    cout << "[3]" << "Паскаль" << endl;
    cout << "Введите ответ: ";
    cin >> a18;
    if (a18 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a18 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "19 вопрос:" << endl; //19
    cout << endl;
    cout << "19: Кто из римских поэтов был выслан из Рима?" << endl;
    cout << "[1]" << "Катулл" << endl;
    cout << "[2]" << "Овидий" << endl;
    cout << "[3]" << "Гораций" << endl;
    cout << "Введите ответ: ";
    cin >> a19;
    if (a19 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a19 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "10 вопрос:" << endl; //20
    cout << endl;
    cout << "10: В каком месте Земного шара сила тяжести больше?" << endl;
    cout << "[1]" << "На полюсах" << endl;
    cout << "[2]" << "На экваторе" << endl;
    cout << "[3]" << "Везде одинаковые" << endl;
    cout << "Введите ответ: ";
    cin >> a20;
    if (a20 == 1)
    {

        cout << "ответ правильный";


    }
    else if (a20 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;


    cout << "21 вопрос:" << endl; //21
    cout << endl;
    cout << "21: На фоне чего изображена Мона Лиза на картине Леонардо да Винчи?" << endl;
    cout << "[1]" << "Бескрайних полей" << endl;
    cout << "[2]" << "Бескрайних лесов" << endl;
    cout << "[3]" << "Горного пейзажа" << endl;
    cout << "Введите ответ: ";
    cin >> a21;
    if (a21 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a21 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "22 вопрос:" << endl; //22
    cout << endl;
    cout << "22: В каком периоде динозавры не жили?" << endl;
    cout << "[1]" << "Юра" << endl;
    cout << "[2]" << "Девон" << endl;
    cout << "[3]" << "Триас" << endl;
    cout << "Введите ответ: ";
    cin >> a22;
    if (a22 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a22 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "23 вопрос:" << endl; //23
    cout << endl;
    cout << "23: сколько пальцев на руке у человека ? " << endl;
    cout << "[1]" << "4 " << endl;
    cout << "[2]" << "5" << endl;
    cout << "[3]" << "6" << endl;
    cout << "Введите ответ: ";
    cin >> a23;
    if (a23 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a23 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "24 вопрос:" << endl; //24
    cout << endl;
    cout << "24: Какой флейте Моцарт посвятил название одной из своих опер?" << endl;
    cout << "[1]" << "Магической" << endl;
    cout << "[2]" << "Забытой" << endl;
    cout << "[3]" << "Волшебной" << endl;
    cout << "Введите ответ: ";
    cin >> a24;
    if (a24 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a24 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "25 вопрос:" << endl; //25
    cout << endl;
    cout << "25: Какая из этих рек течёт с юга на север?" << endl;
    cout << "[1]" << "Нил" << endl;
    cout << "[2]" << "Днепр" << endl;
    cout << "[3]" << "Волга" << endl;
    cout << "Введите ответ: ";
    cin >> a25;
    if (a25 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a25 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "26 вопрос:" << endl; //26
    cout << endl;
    cout << "26: Как называлась первая российская марксистская нелегальная газета?" << endl;
    cout << "[1]" << "Искра" << endl;
    cout << "[2]" << "Спичка" << endl;
    cout << "[3]" << "Зажигалка" << endl;
    cout << "Введите ответ: ";
    cin >> a26;
    if (a26 == 1)
    {

        cout << "ответ правильный";

    }
    else if (26 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "27 вопрос:" << endl; //27
    cout << endl;
    cout << "27: Как в кириллице называлась современная буква Д?" << endl;
    cout << "[1]" << "Дом" << endl;
    cout << "[2]" << "Дело" << endl;
    cout << "[3]" << "Добро" << endl;
    cout << "Введите ответ: ";
    cin >> a27;
    if (a27 == 3)
    {
        cout << "ответ правильный";

    }
    else if (a27 != 3)
    {
        cout << "ответ не правельный";
    }
    cout << endl;

    cout << "28 вопрос:" << endl; //28
    cout << endl;
    cout << "1: на каком язык програмирования это написанно ? " << endl;
    cout << "[1]" << "С# " << endl;
    cout << "[2]" << "C++" << endl;
    cout << "[3]" << "pithon" << endl;
    cout << "Введите ответ: ";
    cin >> a28;
    if (a28 == 2)
    {
        cout << "ответ правильный";

    }
    else if (a28 != 2)
    {
        cout << "ответ не правельный";

    }
    cout << endl;

    cout << "29 вопрос:" << endl; //29
    cout << endl;
    cout << "29: При каком французском короле случилась Варфоломеевская ночь?" << endl;
    cout << "[1]" << "Людовик 8" << endl;
    cout << "[2]" << "Генрих 4" << endl;
    cout << "[3]" << "Карл 4" << endl;
    cout << "Введите ответ: ";
    cin >> a29;
    if (a29 == 3)
    {

        cout << "ответ правильный";

    }
    else if (a29 != 3)
    {

        cout << "ответ не правельный";

    }
    cout << endl;



    cout << "30 вопрос:" << endl;//30
    cout << endl;
    cout << "30: Какая мировая религия считается самой молодой?" << endl;
    cout << "[1]" << "Буддизм" << endl;
    cout << "[2]" << "Ислам" << endl;
    cout << "[3]" << "Иудаизм" << endl;
    cout << "Введите ответ: ";
    cin >> a30;
    if (a30 == 2)
    {
        cout << "ответ правильный";

    }
    else if (a30 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;


    cout << "31 вопрос:" << endl;//31
    cout << endl;
    cout << "31: каоке покрытие на полу в этом кабинете ? " << endl;
    cout << "[1]" << "линолиум " << endl;
    cout << "[2]" << "ламинат" << endl;
    cout << "[3]" << "паркет" << endl;
    cout << "Введите ответ: ";
    cin >> a31;
    if (a31 == 1)
    {
        cout << "ответ правильный";

    }
    else if (a30 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;


    cout << "32 вопрос:" << endl;//32
    cout << endl;
    cout << "32: что такое эретроцит  ? " << endl;
    cout << "[1]" << "химический элеиент " << endl;
    cout << "[2]" << "кровяное тельце" << endl;
    cout << "[3]" << "составная часть каой-либо платы" << endl;
    cout << "Введите ответ: ";
    cin >> a32;
    if (a32 == 2)
    {

        cout << "ответ правильный";

    }
    else if (a32 != 2)
    {

        cout << "ответ не правельный";

    }
    cout << endl;


    cout << "33 вопрос:" << endl;//33
    cout << endl;
    cout << "33: С2Н6О что это  ? " << endl;
    cout << "[1]" << "спирт " << endl;
    cout << "[2]" << "амфетамин" << endl;
    cout << "[3]" << "кислота" << endl;
    cout << "Введите ответ: ";
    cin >> a33;
    if (a33 == 1)
    {

        cout << "ответ правильный";

    }
    else if (a33 != 1)
    {

        cout << "ответ не правельный";

    }
    cout << endl;


    cout << "34 вопрос:" << endl;//34
    cout << endl;
    cout << "34: какой процес отвечает за питание растений ? " << endl;
    cout << "[1]" << "впитывание " << endl;
    cout << "[2]" << "фотосинтез" << endl;
    cout << "[3]" << "апоптоз" << endl;
    cout << "Введите ответ: ";
    cin >> a34;
    if (a34 == 2)
    {
        cout << "ответ правильный";

    }
    else if (a34 != 2)
    {
        cout << "ответ не правельный";
    }
    cout << endl;


    cout << "35 вопрос:" << endl;//35
    cout << endl;
    cout << "35: какой двигатель стоит в мазде rx-7 ? " << endl;
    cout << "[1]" << "v8 " << endl;
    cout << "[2]" << "h6" << endl;
    cout << "[3]" << "ротор" << endl;
    cout << "Введите ответ: ";
    cin >> a35;
    if (a35 == 3)
    {
        cout << "ответ правильный";

    }
    else if (a35 != 3)
    {
        cout << "ответ не правельный";
    }
    cout << endl;


    cout << "36 вопрос:" << endl;//36
    cout << endl;
    cout << "36: какой процес отвечает за суицыд мутировшмх клеток ? " << endl;
    cout << "[1]" << "апоптоз " << endl;
    cout << "[2]" << "фотосинтез" << endl;
    cout << "[3]" << "никакой" << endl;
    cout << "Введите ответ: ";
    cin >> a36;
    if (a36 == 1)
    {
        cout << "ответ правильный";

    }
    else if (a36 != 1)
    {
        cout << "ответ не правельный";
    }
    cout << endl;


    cout << "37 вопрос:" << endl;//37
    cout << endl;
    cout << "37: Какого отряда земноводных не существует?" << endl;
    cout << "[1]" << "Безхвостые" << endl;
    cout << "[2]" << "Безголовые" << endl;
    cout << "[3]" << "Безногие" << endl;
    cout << "Введите ответ: ";
    cin >> a37;
    if (a37 == 2)
    {
        cout << "ответ правильный";

    }
    else if (a37 != 2)
    {
        cout << "ответ не правельный";
    }
    cout << endl;


    cout << "38 вопрос:" << endl;//38
    cout << endl;
    cout << "38: Сколько пятниц на неделе бывает у человека, который любит менять свои решения?" << endl;
    cout << "[1]" << "7" << endl;
    cout << "[2]" << "5" << endl;
    cout << "[3]" << "30" << endl;
    cout << "Введите ответ: ";
    cin >> a38;
    if (a38 == 1)
    {
        cout << "ответ правильный";

    }
    else if (a38 != 1)
    {
        cout << "ответ не правельный";
    }
    cout << endl;


    cout << "39 вопрос:" << endl;//39
    cout << endl;
    cout << "39: Кто первым в мире спроектировал и запатентовал самолёт?" << endl;
    cout << "[1]" << "Можайский" << endl;
    cout << "[2]" << "Жуковский" << endl;
    cout << "[3]" << "Сикорский" << endl;
    cout << "Введите ответ: ";
    cin >> a39;
    if (a39 == 1)
    {
        cout << "ответ правильный";

    }
    else if (a39 != 1)
    {
        cout << "ответ не правельный";
    }
    cout << endl;


    cout << "40 вопрос:" << endl;//40
    cout << endl;
    cout << "40: Назовите столицу Марокко." << endl;
    cout << "[1]" << "Дакка" << endl;
    cout << "[2]" << "Рабат" << endl;
    cout << "[3]" << "Марракеш" << endl;
    cout << "Введите ответ: ";
    cin >> a40;
    if (a40 == 2)
    {
        cout << "ответ правильный";

    }
    else if (a40 != 2)
    {
        cout << "ответ не правельный";

    }

    return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
